finalize and documentation
